//------------------------------------------------------------------------------
// rectangle.cpp - содержит процедуру ввода параметров
// для уже созданного прямоугольника
//------------------------------------------------------------------------------

#include "rectangle.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника из файла
void In(rectangle &r, ifstream &ifst) {
    string x1, x2, y1, y2, colorNumber;
    ifst >> x1 >> y1 >> x2 >> y2 >> colorNumber;
    r.p1.x = StringToInt(x1);
    r.p1.y = StringToInt(y1);
    r.p2.x = StringToInt(x2);
    r.p2.y = StringToInt(y2);
}

// Случайный ввод параметров прямоугольника
void InRnd(rectangle &r) {
    r.p1.x = Random();
    r.p1.y = Random();
    do {
        r.p2.x = Random();
        r.p2.y = Random();
    } while (!(r.p1.x < r.p2.y && r.p1.y > r.p2.y));
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
void Out(rectangle &r, ofstream &ofst) {
    ofst << "It is Rectangle: x1 = " << r.p1.x << ", y1 = " << r.p1.y <<
    ", x2 = " << r.p2.x << ", y2 = " << r.p2.y <<
    ". Area = " << Area(r);
}

//------------------------------------------------------------------------------
// Вычисление площади прямоугольника
double Area(rectangle &r) {
    return 0.5 * (r.p2.x - r.p1.x) * (r.p1.y - r.p2.y);
}
